dominichuggonsonotteo-prog/GridInv3P/MDK_ARM/.pack/Keil/STM32F3xx_DFP.2.1.0/MDK/Boards/ST/STM32F3-Discovery/Common/LED_STM32F3-Discovery.c
/*-----------------------------------------------------------------------------
 * Name:    LED_STM32F3-Discovery.c
 * Purpose: LED interface for STM32F3-Discovery board
 * Rev.:    1.1.0
 *----------------------------------------------------------------------------*/

/* Copyright (c) 2013 - 2017 ARM LIMITED

   All rights reserved.
   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions are met:
   - Redistributions of source code must retain the above copyright
     notice, this list of conditions and the following disclaimer.
   - Redistributions in binary form must reproduce the above copyright
     notice, this list of conditions and the following disclaimer in the
     documentation and/or other materials provided with the distribution.
   - Neither the name of ARM nor the names of its contributors may be used
     to endorse or promote products derived from this software without
     specific prior written permission.
   *
   THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
   AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
   IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
   ARE DISCLAIMED. IN NO EVENT SHALL COPYRIGHT HOLDERS AND CONTRIBUTORS BE
   LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
   CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
   SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
   INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
   CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
   ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
   POSSIBILITY OF SUCH DAMAGE.
   ---------------------------------------------------------------------------*/

/*! \page stm32f3_discovery_bsi_led LED BSI Setup

The BSI LED requires:
  - Setup of pins used for LED
 
Pinout tab
----------
  1. Click on <b>PE8</b> pin and select <b>GPIO_Output</b> function
  2. Click on <b>PE9</b> pin and select <b>GPIO_Output</b> function
  3. Click on <b>PE10</b> pin and select <b>GPIO_Output</b> function
  4. Click on <b>PE11</b> pin and select <b>GPIO_Output</b> function
  5. Click on <b>PE12</b> pin and select <b>GPIO_Output</b> function
  6. Click on <b>PE13</b> pin and select <b>GPIO_Output</b> function
  7. Click on <b>PE14</b> pin and select <b>GPIO_Output</b> function
  8. Click on <b>PE15</b> pin and select <b>GPIO_Output</b> function
*/

#include "Board_LED.h"                  // ::Board Support:LED

#include "stm32f3xx_hal.h"              // Device HAL
#include "MX_Device.h"

typedef struct {
  GPIO_TypeDef *port;
  uint16_t      pin;
  GPIO_PinState active_state;
  uint8_t       reserved;
} PIN_CONFIG_t;

/* ------------------------------- Configuration ---------------------------- */
#define LED_NUM                         8U

#ifndef HAL_GPIO_MODULE_ENABLED
  #error "::Device:STM32Cube Framework (API): STM32CubeMX: Enable GPIO!"
#endif

#if ((!defined(MX_PE8_Pin))  || (!defined(MX_PE9_Pin))  || (!defined(MX_PE10_Pin)) || (!defined(MX_PE11_Pin)) || \
     (!defined(MX_PE12_Pin)) || (!defined(MX_PE13_Pin)) || (!defined(MX_PE14_Pin)) || (!defined(MX_PE15_Pin))  )
  #error "::Device:STM32Cube Framework (API): STM32CubeMX: Set pins PE8..15 to GPIO_Output function!"
#endif

static const PIN_CONFIG_t PIN_CONFIG[LED_NUM] = {
    { MX_PE8_GPIOx,  MX_PE8_GPIO_Pin,  GPIO_PIN_SET, 0U }
  , { MX_PE9_GPIOx,  MX_PE9_GPIO_Pin,  GPIO_PIN_SET, 0U }
  , { MX_PE10_GPIOx, MX_PE10_GPIO_Pin, GPIO_PIN_SET, 0U }
  , { MX_PE11_GPIOx, MX_PE11_GPIO_Pin, GPIO_PIN_SET, 0U }
  , { MX_PE12_GPIOx, MX_PE12_GPIO_Pin, GPIO_PIN_SET, 0U }
  , { MX_PE13_GPIOx, MX_PE13_GPIO_Pin, GPIO_PIN_SET, 0U }
  , { MX_PE14_GPIOx, MX_PE14_GPIO_Pin, GPIO_PIN_SET, 0U }
  , { MX_PE15_GPIOx, MX_PE15_GPIO_Pin, GPIO_PIN_SET, 0U }
};
/* -------------------------------------------------------------------------- */

/**
  \fn          int32_t LED_Initialize (void)
  \brief       Initialize I/O interface for LEDs
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t LED_Initialize (void) {

  // All initialization code is generated by CubeMX
  return 0;
}

/**
  \fn          int32_t LED_Uninitialize (void)
  \brief       De-initialize I/O interface for LEDs
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t LED_Uninitialize (void) {

  // All de-initialization code is generated by CubeMX
  return 0;
}

/**
  \fn          int32_t LED_On (uint32_t num)
  \brief       Turn on requested LED
  \param[in]   num  LED number
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t LED_On (uint32_t num) {

  if (num >= LED_NUM) {
    return -1;
  }

  if (PIN_CONFIG[num].active_state == GPIO_PIN_RESET) {
    HAL_GPIO_WritePin(PIN_CONFIG[num].port, PIN_CONFIG[num].pin, GPIO_PIN_RESET);
  } else {
    HAL_GPIO_WritePin(PIN_CONFIG[num].port, PIN_CONFIG[num].pin, GPIO_PIN_SET);
  }

  return 0;
}

/**
  \fn          int32_t LED_Off (uint32_t num)
  \brief       Turn off requested LED
  \param[in]   num  LED number
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t LED_Off (uint32_t num) {

  if (num >= LED_NUM) {
    return -1;
  }

  if (PIN_CONFIG[num].active_state == GPIO_PIN_RESET) {
    HAL_GPIO_WritePin(PIN_CONFIG[num].port, PIN_CONFIG[num].pin, GPIO_PIN_SET);
  } else {
    HAL_GPIO_WritePin(PIN_CONFIG[num].port, PIN_CONFIG[num].pin, GPIO_PIN_RESET);
  }

  return 0;
}

/**
  \fn          int32_t LED_SetOut (uint32_t val)
  \brief       Write value to LEDs
  \param[in]   val  value to be displayed on LEDs
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t LED_SetOut(uint32_t value) {
  uint8_t i;

  for (i = 0U; i < LED_NUM; i++) {
    if (value & (1UL << i)) {
      LED_On(i);
    } else {
      LED_Off(i);
    }
  }

  return 0;
}

/**
  \fn          uint32_t LED_GetCount (void)
  \brief       Get number of LEDs
  \return      Number of available LEDs
*/
uint32_t LED_GetCount (void) {
  return LED_NUM;
}

